bes_job_hpcbp/test/steve.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soa
penv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchem
a" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><ns1:Action soapen
v:mustUnderstand="0" xmlns:ns1="http://www.w3.org/2005/08/addressing">http://schemas.ggf.or
g/bes/2006/08/bes-factory/BESFactoryPortType/CreateActivity</ns1:Action><ns2:To soapenv:mus
tUnderstand="0" xmlns:ns2="http://www.w3.org/2005/08/addressing">http://gridway.fdi.ucm.es:
8080/gridsam/services/bes</ns2:To></soapenv:Header><soapenv:Body><bes:CreateActivity xmlns:
bes="http://schemas.ggf.org/bes/2006/08/bes-factory"><bes:ActivityDocument><JobDefinition x
mlns="http://schemas.ggf.org/jsdl/2005/11/jsdl">
...

<?xml version="1.0" encoding="UTF-8"?
>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http
://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapen
v:Header>
<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecuri
ty-secext-1.0.xsd" soapenv:mustUnderstand="1"><wsse:BinarySecurityToken xmlns:wsu="http://d
ocs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" EncodingType="h
ttp://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Bina
ry" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1
.0#X509v3" wsu:Id="CertId-800392">MIICLzCCAZigAwIBAgIBBTANBgkqhkiG9w0BAQUFADBDMQ0wCwYDVQQKE
wRHcmlkMRcwFQYDVQQLEw5JR0UtVGVzdGJlZC1DQTEZMBcGA1UEAxMQR2xvYnVzIFNpbXBsZSBDQTAeFw0xMTA2MzAx
NTA3MDhaFw0xMjA2MjkxNTA3MDhaMGExDTALBgNVBAoTBEdyaWQxEzARBgNVBAsTCkdsb2J1c1Rlc3QxFzAVBgNVBAs
TDklHRS1UZXN0YmVkLUNBMQwwCgYDVQQLEwNMUloxFDASBgNVBAMUC2lnZV91c2VyMDAyMIGfMA0GCSqGSIb3DQEBAQ
UAA4GNADCBiQKBgQC1mMxIMYWMLlBgCnK5dtNLv4+S14jTxH24hAZXpC4lU1t0ubJJBRl0boydV6G9AvXKkahrgagxM
SV6e8H3uwidZElo00FjsC+mzFsgLaKf5inQIZLBPOBEyiJoOpIdFnq/cMIx4g2WgVMs28ucWolGRWOoinXhKGVz0gqe
lw3EaQIDAQABoxUwEzARBglghkgBhvhCAQEEBAMCBPAwDQYJKoZIhvcNAQEFBQADgYEAJs/t3vQx7gwZLp7qpdKnFPP
rRLeinUwERMiePoz+CoAGjCseDzI5pbRAkauxaICtehRyKwVnsCfNPpyBDRab4YthXFk90bpQvQDIM3jC/7LbwHrPq/
B4dl9x9Lo1MD3KJp9BVCgmQCo5WaSq1TXlI5+R26nCR6lmPb5gzXDmN80=</wsse:BinarySecurityToken><ds:Si
gnature xmlns:ds="http://www.w3.org/2000/09/xmldsig#" Id="Signature-1620636050">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Canonic
alizationMethod>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></ds:SignatureMe
thod>
<ds:Reference URI="#id-493579349">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
<ds:DigestValue>1sdb5kPUCQTmmFtpS//W5YybzOI=</ds:DigestValue>
</ds:Reference>
<ds:Reference URI="#Timestamp-2134123845">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></ds:Transform>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></ds:DigestMethod>
<ds:DigestValue>IwE9wtwDbHU3ZVVA7P8KqtmZWmM=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
HQLHI0VYiI7G0pnll49CQDMQeyNF0NkP0qMlwZ6JY/vO/SbWlF+HRuFbf+ndvLsOm/s9nN79sZTC
rKqyhGNCHkwI8aZf5fyPz+XUZQ+XzCLlfvL15KOL7n/Sedmt048vJOHjdgmUj2bqrT7pfADHBMgL
i5LpO6V36L20XcvLx7w=
</ds:SignatureValue>
<ds:KeyInfo Id="KeyId-863455443">
<wsse:SecurityTokenReference xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="STRId-284322014"><wsse:Reference URI="#CertId-800392" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"></wsse:Reference></wsse:SecurityTokenReference>
</ds:KeyInfo>
</ds:Signature><wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="Timestamp-2134123845"><wsu:Created>2012-03-13T10:59:28.987Z</wsu:Created><wsu:Expires>2012-03-13T11:04:28.987Z</wsu:Expires></wsu:Timestamp></wsse:Security><ns1:Action xmlns:ns1="http://www.w3.org/2005/08/addressing" soapenv:mustUnderstand="0">http://schemas.ggf.org/bes/2006/08/bes-factory/BESFactoryPortType/CreateActivity</ns1:Action><ns2:To xmlns:ns2="http://www.w3.org/2005/08/addressing" soapenv:mustUnderstand="0">http://gridway.fdi.ucm.es:8080/gridsam/services/bes</ns2:To></soapenv:Header><soapenv:Body xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="id-493579349"><bes:CreateActivity xmlns:bes="http://schemas.ggf.org/bes/2006/08/bes-factory"><bes:ActivityDocument><JobDefinition xmlns="http://schemas.ggf.org/jsdl/2005/11/jsdl">
   <JobDescription>
       <Application>
           <HPCProfileApplication xmlns="http://schemas.ggf.org/jsdl/2006/07/jsdl-hpcpa">
               <Executable>/opt/share/minem-uf/update_file</Executable>
               <Argument>input.txt</Argument>
               <Argument>output.txt</Argument>
               <Output>stdout.txt</Output>
               <Error>stderr.txt</Error>

           </HPCProfileApplication>

       </Application>

       <Resources><CandidateHosts>
               <HostName>gt5-ige.drg.lrz.de</HostName>
               </CandidateHosts></Resources>

       <DataStaging>
           <FileName>input.txt</FileName>
           <CreationFlag>overwrite</CreationFlag>
           <Source>

<URI>ftp://zam1161v01.zam.kfa-juelich.de:8004//home/interopdata/ogf34/minem_2_1.in.101</URI>
           </Source>
           <ac:Credential xmlns:ac="http://schemas.ogf.org/hpcp/2007/11/ac">
                   <wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                       <wsse:Username>interopdata</wsse:Username>
                       <wsse:Password>(67airbus380)</wsse:Password>
                   </wsse:UsernameToken>
               </ac:Credential>
       </DataStaging>
       <DataStaging>
           <FileName>output.txt</FileName>
           <CreationFlag>overwrite</CreationFlag>
           <Target>

<URI>ftp://zam1161v01.zam.kfa-juelich.de:8004//home/interopdata/ogf34/minem_2_1.out.101</URI>
           </Target>
           <ac:Credential xmlns:ac="http://schemas.ogf.org/hpcp/2007/11/ac">
                   <wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                       <wsse:Username>interopdata</wsse:Username>
                       <wsse:Password>(67airbus380)</wsse:Password>
                   </wsse:UsernameToken>
               </ac:Credential>
       </DataStaging>

       <DataStaging>
           <FileName>stdout.txt</FileName>
           <CreationFlag>overwrite</CreationFlag>
           <Target>

<URI>ftp://zam1161v01.zam.kfa-juelich.de:8004//home/interopdata/ogf34/stdout_1.txt.101</URI>
           </Target>
           <ac:Credential xmlns:ac="http://schemas.ogf.org/hpcp/2007/11/ac">
                   <wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                       <wsse:Username>interopdata</wsse:Username>
                       <wsse:Password>(67airbus380)</wsse:Password>
                   </wsse:UsernameToken>
               </ac:Credential>
       </DataStaging>
       <DataStaging>
           <FileName>stderr.txt</FileName>
           <CreationFlag>overwrite</CreationFlag>
           <Target>

<URI>ftp://zam1161v01.zam.kfa-juelich.de:8004//home/interopdata/ogf34/stderr_1.txt.101</URI>
           </Target>
           <ac:Credential xmlns:ac="http://schemas.ogf.org/hpcp/2007/11/ac">
                   <wsse:UsernameToken xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
                       <wsse:Username>interopdata</wsse:Username>
                       <wsse:Password>(67airbus380)</wsse:Password>
                   </wsse:UsernameToken>
               </ac:Credential>
       </DataStaging>
   </JobDescription>

</JobDefinition></bes:ActivityDocument></bes:CreateActivity></soapenv:Body></soapenv:Envelope>

